# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть.

n = int(input('Количество монеток: '))
k = 0
for i in range(n):
    coin = int(input('Введите сторону 0 - герб, 1 - решка: '))
    if coin == 1:
        k += 1
print(f'Минимальное кол-во монет, которое нужно перевернуть - {k if k<n/2 else n-k}')